// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
let arr = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100];
let res = arr[0] + arr[1] + arr[2] + arr[3] + arr[4] + arr[5] + arr[6] + arr[7] + arr[8] + arr[9];
console.log(res)
// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book = {name: 'Щоденник Анни Франк', number:`152`,genre:`автобіографія` }
console.log(book)
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автор
let bbook = {name: 'Собака Баскервілів', number:319,genre:`Детективний роман`, author:'Артур Конан Дойл' }
console.log(bbook)
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
let coll =[ {name: 'Собака Баскервілів', number:319,genre:`Детективний роман`, author:'Артур Конан Дойл' }]
console.log(coll)
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
let w = 20;
let h = 5;
let doll = w * h;
console.log(doll)
// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
let heightC, dc, PI, r, v;
heightC = 10
dc = 4
PI = 3.14
r=4/2
v=PI*(r**2)*heightC
console.log(v)

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
let n = 3;
let m = 4;
let versace = Math.sqrt(Math.pow(n,2)+Math.pow(m,4))
console.log(versace)

