// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
let result = 10 + 20 + 30 + 40 + 50 + 60 + 70 + 80 + 90 + 100;
console.log(result)
// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book = {name: 'Щоденник Анни Франк', number:`152`,genre:`автобіографія` }
console.log(book)
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автор
let bbook = {name: 'Собака Баскервілів', number:319,genre:`Детективний роман`, author:'Артур Конан Дойл' }
console.log(bbook)
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// ВИБАЧТЕ, АЛЕ Я ГУМАНІТАРІЙ
// направду ніфігашечки тут не розумію!!!