// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'
// -------------------------------------------------------------------------------------------------------------
// isSymbolLetter = (array) => {
//     return array.map(str => {
//         return {
//             letters: str.toLowerCase().split('').filter(a => a >= 'a' && a <= 'z').length
//         };
//     });
// }
// let data = ['hello world', 'lorem ipsum', 'javascript is cool'];
// console.log(isSymbolLetter(data));
// ==========================================================================================================
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'
// -------------------------------------------------------------------------------------------------------------
// let text = "hello world, lorem ipsum, javascript is cool"
// let newtext = text.toUpperCase();
// console.log(newtext);
// (ну або кожну стрінгу окремо)
// ==========================================================================================================
// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'
// -------------------------------------------------------------------------------------------------------------
// let text = "HELLO WORLD, LOREM IPSUM, JAVASCRIPT IS COOL"
// let newtext = text.toLowerCase();
// console.log(newtext);
// ==========================================================================================================
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.
// -------------------------------------------------------------------------------------------------------------
// let str = ' dirty string   '
// console.log(str.trim())
// ==========================================================================================================
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
// -------------------------------------------------------------------------------------------------------------
// let str = 'Каждый охотник желает знать';
// let arr = stringToarray(str);
// document.writeln(arr); // ['Каждый', 'охотник', 'желает', 'знать']
// let str = "Кожен мисливець бажає знати"
// let split = str.split(" ")
// console.log(split)
// ==========================================================================================================
// - Напишіть функцію delete_characters(str, length), яка повертає підрядок, що складається із зазначеної кількості символів.
// -------------------------------------------------------------------------------------------------------------
// let str = 'Каждый охотник желает знать';
// document.writeln(delete_characters(str, 7)); // Каждый
// let str = "Кожен мисливець бажає знати"
// let delete_characters = (str, length) => {
//     return str.slice(0, length)
// }
// console.log(delete_characters(str, 6))
// length = 6 того,шо слово "Каждый" написала українською,короче різна кількість букв у словах)
// ==========================================================================================================
// - Напишіть функцію insert_dash(str), яка приймає рядок str як аргумент і вставляє тире (-) між словами. При цьому всі символи рядка необхідно перевести у верхній регістр.
// -------------------------------------------------------------------------------------------------------------
// let str = "HTML JavaScript PHP"
// let insert_dash = (str) => {
//     return str.replaceAll(" ", "-").toUpperCase()
// }
// console.log(insert_dash(str))
// ==========================================================================================================
// - Напишіть функцію, яка приймає рядок як аргумент і перетворює регістр першого символу рядка з нижнього регістру у верхній.
// -------------------------------------------------------------------------------------------------------------
// let str = "hello world"
// let fun = (str) => {
//     return str[0].toUpperCase() + str.slice(1)
// }
// console.log(fun(str))
// ==========================================================================================================
// - Напишіть функцію capitalize(str), яка повертає рядок, у якому кожне слово починається з великої літери.
// -------------------------------------------------------------------------------------------------------------
// let str = "hello world"
// console.log(str.split(/\s+/).map(word => word[0].toUpperCase() + word.substring(1)).join(' '));